[
  {
    "id": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Mother-in-Law’s Tongue, is one of the most durable indoor plants you can own. It thrives in low light conditions and requires minimal watering, making it ideal for beginners or busy individuals. This plant naturally purifies indoor air by removing toxins such as formaldehyde and benzene, helping to create a cleaner living space. Its upright sword-shaped leaves add a modern, sculptural touch to any room. Perfect for bedrooms, offices, and living areas, the Snake Plant effortlessly combines style, sustainability, and wellness in one elegant form.",
    "image": "https://i.ibb.co/TxhWw6kf/images.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "id": 2,
    "plantName": "Peace Lily",
    "category": "Flowering Plant",
    "price": 22,
    "rating": 4.6,
    "availableStock": 15,
    "careLevel": "Medium",
    "description": "The Peace Lily is a timeless favorite among plant lovers for its graceful white blooms and lush green foliage. It is an excellent natural air purifier that helps remove common household toxins and promotes cleaner air. Peace Lilies prefer indirect light and moderate watering, making them a great choice for offices or shaded indoor corners. They also signal their need for water by slightly drooping their leaves, which quickly perk up after watering. With their elegant aesthetic and beneficial air-cleaning properties, Peace Lilies bring both beauty and health benefits to any indoor space.",
    "image": "https://i.ibb.co/Hfk6QYDV/pngtree-a-beauty-plant-in-white-pot-on-background-png-image-10785997.png",
    "providerName": "Leafy Luxe"
  },
  {
    "id": 3,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 14,
    "rating": 4.5,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "The Spider Plant is one of the easiest and most adaptable houseplants you can grow. It features long, arching leaves with green and white stripes that look stunning in hanging baskets. This hardy plant tolerates low light and occasional neglect, making it ideal for beginners. It also acts as a natural air purifier, helping remove toxins like carbon monoxide and formaldehyde from indoor air. With proper care, Spider Plants produce small white flowers and baby plantlets that can be propagated easily, offering endless possibilities for decorating your living or working space naturally.",
    "image": "https://i.ibb.co/4w0mxx2t/images-2.jpg",
    "providerName": "GreenScape"
  },
  {
    "id": 4,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 12,
    "rating": 4.7,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "Aloe Vera is a succulent plant cherished for both its healing properties and decorative beauty. Known for its thick, fleshy leaves filled with soothing gel, it’s perfect for treating minor burns, skin irritation, and dryness. Aloe thrives in bright, indirect sunlight and requires minimal watering, making it a low-maintenance choice for indoor gardens. Beyond its medicinal uses, Aloe Vera enhances indoor aesthetics with its modern, clean look. Whether placed on a windowsill, desk, or kitchen counter, this versatile plant adds a refreshing touch of greenery and promotes a calm, healthy home environment.",
    "image": "https://i.ibb.co/gZ6vnYb0/download-1.jpg",
    "providerName": "UrbanGreen Studio"
  }
]
